defmodule Man.Repo.Migrations.SetContractForm do
  @moduledoc false

  use Ecto.Migration

  def change do
    execute("""
    UPDATE templates SET body = '
    <!DOCTYPE html>
    <html>
    <head>
    <meta charset="utf-8">
    <title>Договір про медичне обслуговування населення за програмою медичних гарантій</title>
    <style>
    body {
    font-family: "Times New Roman";
    font-size: 14px;
    }

    h2 {
    page-break-after: avoid;
    text-align: center;
    }

    section > header {
    text-align: center;
    }
    section > footer {
    display: flex;
    justify-content: space-between;
    font-weight: bold;
    }

    p.bold {
    font-weight: bold;
    }
    p.italic {
    font-style: italic;
    text-align: center;
    }
    p.small {
    font-size: 10px;
    }

    p.block {
    display: block;
    }
    p.block span {
    display: inline-block;
    width: 20%;
    }

    div.info {
    display: inline-block;
    float: right;
    max-width: 300px;
    }
    div.wrapper {
    clear: both;
    }

    ol.roman {
    list-style-type: upper-roman;
    }
    ol.sub {
    list-style-type: none;
    counter-reset: item;
    margin: 0;
    padding: 0;
    }
    ol.sub li {
    display: table;
    counter-increment: item;
    margin-bottom: 0.6em;
    }
    ol.sub li:before {
      content: " ";
      display: table-cell;
      padding-right: 0.6em;
    }
    ol.sub li li {
      margin: 0;
    }
    ol.sub li li:before {
      content: counters(item, ".") ". ";
    }
    ol.topMargin {
    margin-top: 10px;
    }

    ul {
    list-style-type: disc;
    }
    ul.nostyle li:before {
    content: " " !important;
    padding-right: 0;
    }
    li.fullsize {
    width: 100%;
    }

    table {
    border-collapse: collapse;
    }
    th, td {
    border: 1px solid #000;
    height: 30px;
    padding: 10px;
    }
    table p {
    margin-bottom: 2em;
    }
    table.two {
    width: 100%;
    }
    table.two td {
    width: 50%;
    }
    table.smallFont {
    font-size: 12px;
    }
    table.smallFont td {
    word-wrap: break-word !important;
    }
    th.name {
    width: 30%;
    }
    th.systemEntry {
    width: 25%;
    }
    th.speciality {
    width: 15%;
    }
    th.fte {
    width: 10%;
    }
    th.patientCount {
    width: 10%;
    }
    .entryTwo th {
    width: 20%;
    }

    .page {
    page-break-before: always !important;
    }
    table {
    	page-break-inside: auto;
    }
    tr {
    	page-break-inside: avoid;
    	page-break-after: auto;
    }

    @media print {
    .smallFont td.name p {
    min-width: 60mm; /*30%*/
    max-width: 63mm;
    }
    .smallFont td.systemEntry p {
    min-width: 50.5mm; /*25%*/
    max-width: 52.5mm;
    }
    .smallFont td.speciality p {
    min-width: 30.5mm; /*15%*/
    max-width: 31.5mm;
    }
    .smallFont td.fte p {
    min-width: 20mm; /*10%*/
    max-width: 21mm;
    }
    .smallFont td.patientCount p {
    min-width: 20mm; /*10%*/
    max-width: 21mm;
    }
    .entityName {
    min-width: 50.5mm; /*25%*/
    max-width: 52.5mm;
    }
    .divisionsId {
    min-width: 30.5mm; /*15%*/
    max-width: 31.5mm;
    }
    }

    @page {
    margin: 2cm;
    }
    </style>
    </head>
    <body>
    <section class="page">
    <header>
    <div class="info">
    ЗАТВЕРДЖЕНО<br />
    постановою Кабінету Міністрів України<br />
    від ______ 2018 р. № ____
    </div>
    <div class="wrapper"></div>
    <p class="bold">
    Типова форма Договору<br />
    про медичне обслуговування населення за програмою медичних<br />
    гарантій
    </p>
    <p>
    Договір<br />
    про медичне обслуговування населення за програмою медичних гарантій
    </p>
    <p class="block">
    <span><%= get_in(assigns, ~w(issue_city)a) %></span>
    <span><%= get_in(assigns, ~w(inserted_at)a) %></span>
    </p>
    </header>

    <section>НСЗУ, в особі (П.І.Б.)
    <%= if get_in(assigns, ~w(nhs_signer second_name)a) do %>
    <%= get_in(assigns, ~w(nhs_signer last_name)a) %>
    <%= get_in(assigns, ~w(nhs_signer first_name)a) %>
    <%= get_in(assigns, ~w(nhs_signer second_name)a) %>
    <% else %>
    <%= get_in(assigns, ~w(nhs_signer.last_name)a) %>
    <%= get_in(assigns, ~w(nhs_signer.first_name)a) %>
    <% end %>
    , що діє на підставі <%= get_in(assigns, ~w(nhs_signer_base)a) %>
    (далі – Замовник), з однієї сторони, та <%= get_in(assigns, ~w(contractor_legal_entity name)a) %>
    (суб’єкт господарювання, який має ліцензію на право провадження господарської діяльності з медичної практики) в особі (П.І.Б.)
    <%= if get_in(assigns, ~w(contractor_owner party second_name)a) do %>
    <%= get_in(assigns, ~w(contractor_owner party last_name)a) %>
    <%= get_in(assigns, ~w(contractor_owner party first_name)a) %>
    <%= get_in(assigns, ~w(contractor_owner party second_name)a) %>
    <% else %>
    <%= get_in(assigns, ~w(contractor_owner party last_name)a) %>
    <%= get_in(assigns, ~w(contractor_owner party first_name)a) %>
    <% end %>
    , що діє на підставі <%= get_in(assigns, ~w(contractor_base)a) %> (далі – Надавач), з другої сторони, які надалі разом іменуються Сторони, а кожен окремо – Сторона, уклали цей Договір про медичне обслуговування населення за програмою медичних гарантій (далі – Договір) на таких умовах:

    <ol class="sub">
    <li>
    <h2>1. ВИЗНАЧЕННЯ ТЕРМІНІВ</h2>
    <ol class="sub">
    <li>Звітний період – календарний місяць.</li>
    <li>Місце надання медичних послуг – фактична адреса здійснення Надавачем господарської діяльності з медичної практики, де особам, на яких розповсюджуються державні гарантії медичного обслуговування населення за Законом України “Про державні фінансові гарантії медичного обслуговування населення” (надалі – пацієнти), надаватимуться медичні послуги.</li>
    <li>Медичні послуги – послуги з медичного обслуговування населення (послуги з охорони здоров’я), що включені до програми державних гарантій медичного обслуговування населення (далі – програма медичних гарантій), які Надавач зобов’язується надавати за цим Договором, перелік та обсяг яких визначений додатками до цього Договору.</li>
    <li>Підрядник – заклад охорони здоров’я або фізична особа-підприємець, які мають ліцензію на право провадження господарської діяльності з медичної практики, та залучені Надавачем на підставі договору для надання окремих медичних послуг пацієнтам за цим Договором.</li>
    <li>Працівник Надавача – медичний працівник, який відповідно до законодавства має право надавати медичну допомогу та перебуває з Надавачем або Підрядником такого Надавача у трудових відносинах.</li>
    <li>ПМД – первинна медична допомога.</li>
    <li>ІМД – інші види медичної допомоги, крім ПМД.</li>
    <li>Система – електронна система охорони здоров’я.</li>
    </ol>
    Інші поняття і терміни вживаються у значеннях, наведених в Основах законодавства України про охорону здоров’я, Законі України “Про державні фінансові гарантії медичного обслуговування населення”, Порядку вибору лікаря, який надає первинну медичну допомогу, затвердженого наказом МОЗ № 503 від 19.03.2018 року, Порядку надання первинної медичної допомоги, затвердженого наказом МОЗ № 504 від 19.03.2018 року, законодавчих актах, що регулюють питання функціонування електронної системи охорони здоров’я.
    </li>
    <li>
    <h2>2. ПРЕДМЕТ ДОГОВОРУ</h2>
    <ol class="sub">
    <li>Відповідно до умов цього Договору Надавач зобов’язується надавати медичні послуги за програмою медичних гарантій пацієнтам, а Замовник зобов’язується оплачувати такі послуги відповідно до встановленого тарифу та коригувальних коефіцієнтів.</li>
    <li>Медичні послуги, які Надавач зобов’язується надавати за цим Договором та спеціальні умови їх надання, визначаються в додатках до цього Договору.</li>
    <li>Медичні послуги за цим Договором надаються відповідно до порядків надання медичної допомоги, затверджених МОЗ, з обов’язковим дотриманням галузевих стандартів у сфері охорони здоров’я та умов, що викладені у додатках до Договору, у Місці надання медичних послуг відповідно до графіку роботи Надавача та лікарями, зазначеними в додатках до цього Договору, крім випадків, передбачених законодавством. Окремі медичні послуги можуть надаватись за місцем проживання (перебування) пацієнта або з використанням засобів телекомунікації відповідно до порядків надання відповідних видів медичної допомоги.</li>
    <li>Протягом строку дії цього Договору кожне Місце надання медичних послуг Надавача, місце надання медичних послуг Підрядників має відповідати державним санітарним нормам й правилам, ліцензійним умовам провадження господарської діяльності з медичної практики, галузевим стандартам у сфері охорони здоров’я, вимогам примірних табелів матеріально-технічного оснащення.</li>
    <li>Надавач несе встановлену законом відповідальність за своєчасність, повноту та якість надання медичних послуг за цим Договором Працівниками Надавача та Підрядниками Надавача. Факт порушення встановлених вимог медичного обслуговування населення підтверджується у встановленому законодавством порядку.</li>
    </ol>
    </li>

    <li>
    <h2>3. ПРАВА ТА ОБОВ’ЯЗКИ СТОРІН</h2>
    <ol class="sub">
    <li>
    Права Замовника:
    	<ol class="sub">
    		<li>вимагати від Надавача належного, своєчасного та у повному обсязі виконання своїх зобов’язань за цим Договором;</li>
    		<li>перевіряти відповідність Надавача Вимогам до надавача послуг з медичного обслуговування населення, з яким головними розпорядниками бюджетних коштів укладаються договори про медичне обслуговування населення, затвердженим Кабінетом Міністрів України;</li>
    		<li>перевіряти дотримання Надавачем, Працівниками Надавача та його Підрядниками умов цього Договору, та у разі виявлення порушень передавати матеріали перевірки уповноваженим державним органам для проведення у встановленому законодавством порядку клініко-експертної оцінки якості надання медичної допомоги та медичного обслуговування та інших заходів;</li>
    		<li>перевіряти повноту та достовірність відомостей про надані медичні послуги за цим Договором відповідно до інформації, що міститься в Системі;</li>
    		<li>запитувати та отримувати від Надавача документи, пов’язані з наданням медичних послуг за цим Договором, скарги пацієнтів (за умови знеособлення даних пацієнтів) та робити з них копії. В процесі перевірки документів НСЗУ має право проводити звірку звітів Надавача з документами про фактично надані медичні послуги та документи, на підставі яких Надавач вносив інформацію до Системи;</li>
    		<li>проводити звірку розрахунків за цим Договором та у разі виявлення невідповідностей чи порушень умов цього Договору, здійснювати перерахунок оплачених медичних послуг, інформувати уповноваженні державні органи про виявлені порушення;</li>
    		<li>призупиняти оплату за Договором у випадках, встановлених законодавством та цим Договором;</li>
    		<li>відмовитись від цього Договору в односторонньому порядку у випадках, передбачених цим Договором.</li>
    	</ol>
    </li>
    <li>
    Обов’язки Замовника:
    <ol class="sub">
    	<li>належним чином, своєчасно та у повному обсязі виконувати свої зобов’язання за цим Договором;</li>
    	<li>проводити на вимогу Надавача звірку розрахунків за Договором;</li>
    	<li>своєчасно здійснювати оплату медичних послуг Надавачу, відповідно до умов цього Договору та законодавства.</li>
    </ol>
    </li>
    <li>
    Права Надавача:
    <ol class="sub">
    	<li>вимагати від Замовника належного, своєчасного та у повному обсязі виконання ним своїх зобов’язань за цим Договором;</li>
    	<li>вимагати від Замовника своєчасної оплати наданих медичних послуг;</li>
    	<li>вимагати проведення звірки розрахунків за Договором.</li>
    </ol>
    </li>
    <li>
    Обов’язки Надавача:
    <ol class="sub">
    	<li>належним чином, своєчасно та у повному обсязі виконувати свої зобов’язання за цим Договором;</li>
    	<li>відповідати Вимогам до надавача послуг з медичного обслуговування населення, з яким головними розпорядниками бюджетних коштів укладаються договори про медичне обслуговування населення, затвердженим Кабінетом Міністрів України;</li>
    	<li>дотримуватися та забезпечити дотримання Підрядниками вимог законодавства України, зокрема, порядків надання медичної допомоги, табелів матеріально-технічного оснащення (в тому числі примірних), галузевих стандартів у сфері охорони здоров’я;</li>
    	<li>надавати якісні медичні послуги відповідно до встановлених законодавством вимог;</li>
    	<li>забезпечити захист персональних даних та медичної інформації пацієнтів відповідно до законодавства, в тому числі Закону України “Про захист персональних даних”;</li>
    	<li>для надання медичних послуг використовувати лікарські засоби та медичні вироби, що дозволені до використання в Україні;</li>
    	<li>забезпечувати реалізацію пацієнтами їх прав на отримання медичних послуг за Договором та відшкодувати збитки, завдані пацієнтам у зв’язку з порушенням вимог цього Договору;</li>
    	<li>перед наданням медичних послуг з’ясувати та повідомити пацієнта (його законного представника), чи має такий пацієнт право на отримання медичних послуг за програмою медичних гарантій за Договором відповідно до наданих документів, перевірити наявність направлення лікаря (за необхідності);</li>
    	<li>негайно звернутися до Замовника, якщо виникають питання щодо прав пацієнта на отримання медичних послуг за цим Договором або виникають інші питання по виконанню Договору;</li>
    	<li>забезпечити, щоб платні послуги, які оплачуються пацієнтами за рахунок власних коштів, надавались пацієнтам тільки після того, як медичні послуги отримали усі пацієнти, які були записані на прийом до лікаря / в чергу на отримання медичних послуг в цей день за цим Договором;</li>
    	<li>забезпечити належні умови праці Працівникам Надавача;</li>
    	<li>забезпечити своєчасне внесення актуальної інформації про Надавача, його керівника, медичних працівників, Підрядників та уповноважених осіб до Системи;</li>
    	<li>надавати на запит Замовника документи, пов’язані з наданням медичних послуг за цим Договором, скарги пацієнтів (за умови знеособлення даних пацієнтів) та підтверджують відповідність Надавача Вимогам до надавача послуг з медичного обслуговування населення, з яким головними розпорядниками бюджетних коштів укладаються договори про медичне обслуговування населення, затвердженим Кабінетом Міністрів України;</li>
    	<li>своєчасно вносити повну та достовірну інформацію, звіти та проекти змін до Договору до Системи у встановленому порядку;</li>
    	<li>розміщувати в Системі, в кожному Місці надання медичних послуг та на своєму веб-сайті (у разі наявності) інформацію для пацієнтів стосовно медичних послуг, які пацієнт може отримати у цього Надавача за програмою медичних гарантій, графіка роботи Надавача, графіка роботи Працівників Надавача;</li>
    	<li>залучати до надання Послуг за цим Договором тільки тих Підрядників, які зазначені в додатках до цього Договору;</li>
    	<li>не пізніше, ніж за п’ять робочих днів з дня надходження заяви лікуючого лікаря, повідомляти пацієнта (його законного представника) про відмову такого лікаря від подальшого ведення пацієнта у зв’язку із тим, що пацієнт не виконує медичних приписів або правил внутрішнього розпорядку Надавача, за умови, що це не загрожуватиме життю пацієнта і здоров’ю населення;</li>
    	<li>не пізніше, ніж за два тижні після припинення трудових відносин з Працівником Надавача або договірних відносин з Підрядником, які зазначені в додатках до цьому Договору, повідомляти  Замовника і вносити відповідну інформацію до Системи;</li>
    	<li>не пізніше, ніж за один тиждень до настання зміни повідомляти Замовника про зміну адреси Місця надання медичних послуг, графіку надання медичних послуг Надавачем, графіку роботи Працівників Надавача, які надають медичну допомогу, контактних даних для запису на прийом до лікаря та вносити відповідну інформацію до Системи;</li>
    	<li>не пізніше, ніж за шість тижнів до припинення медичної практики, або подання заяви про припинення цього Договору за ініціативою Надавача, повідомляти про це Замовника та пацієнтів, вносити відповідну інформацію до Системи;</li>
    	<li>інформувати Замовника про заплановані реорганізацію, ліквідацію Надавача або про початок процедури банкрутства;</li>
    	<li>не передавати всі або частину прав та обов’язків за Договором третім особам без попередньої письмової згоди Замовника;</li>
    	<li>допускати уповноважених осіб Замовника для проведення перевірки дотримання Надавачем вимог цього Договору, надавати документи, що стосуються надання медичних послуг за Договором та документи, на підставі яких вносилась інформація до Системи, фінансову та статистичну звітність, проводити звірку розрахунків за Договором та повертати Замовнику надміру сплачені кошти за Договором.</li>
    </ol>
    </li>
    <li>
    Надавач зобов’язується включити до договорів з Підрядниками умови щодо надання медичних послуг, що забезпечать дотримання Підрядниками вимог, передбачених цим Договором.
    </li>
    <li>
    Цей Договір є договором на користь третіх осіб – пацієнтів, в частині надання їм медичних послуг Надавачем.
    </li>
    <li>
    Пацієнт, набуває прав на отримання медичних послуг, пов’язаних з ПМД, за Договором з моменту подання Надавачу у встановленому законодавством порядку декларації про вибір лікаря, який надає ПМД.
    </li>
    <li>
    Пацієнт, набуває прав на отримання медичних послуг, пов’язаних з ІМД за Договором, з моменту звернення до Надавача за направленням лікаря, який надає ПМД, або лікуючого лікаря в порядку, встановленому МОЗ, або без такого направлення, коли згідно із законодавством направлення лікаря не вимагається.
    </li>
    </ol>
    </li>
    <li>
    <h2>4. ЗВІТНІСТЬ НАДАВАЧА</h2>
    <ol class="sub">
    <li>
    Надавач зобов’язаний скласти через Систему звіт, в якому зазначається обсяг медичних послуг, які підлягають оплаті за Звітний період (далі – Звіт). У Звіті щодо медичних послуг, пов’язаних з ПМД, має бути зазначена кількість пацієнтів, які подали такому Надавачу декларації, про вибір лікаря, який надає ПМД, станом на 1-ше число Звітного періоду із зазначенням вікових груп та інших критеріїв, що впливають на застосування коригувальних коефіцієнтів. Звіт є первинним документом.
    </li>
    <li>
    Надавач зобов’язаний подати Замовнику через Систему Звіт про медичні послуги, пов’язані з:
    	<ul class="nostyle">
    		<li>ПМД – до 5-го числа Звітного періоду;</li>
    		<li>ІМД – протягом п’яти календарних днів після закінчення Звітного періоду.</li>
    	</ul>
    </li>
    <li>
    У разі виявлення невідповідностей між даними звіту та інформацією в Системі, даними фінансової чи статистичної звітності Замовник має право подати заперечення до звіту Надавачу протягом десяти календарних днів з дати його отримання. Надавач зобов’язаний розглянути заперечення та подати уточнений Звіт з усунутими невідповідностями протягом трьох календарних днів з дати їх отримання.
    </li>
    <li>
    Разом зі звітом Надавач надсилає Замовнику рахунок, який має містити опис та загальну вартість медичних послуг за Звітний період.
    </li>
    </ol>
    </li>
    <li>
    <h2>5. УМОВИ, ПОРЯДОК ТА СТРОКИ ОПЛАТИ ТАРИФУ. ЦІНА ДОГОВОРУ</h2>
    <ol class="sub">
    <li>
    Замовник зобов’язується оплачувати медичні послуги, що надаються пацієнтам за цим Договором, згідно з тарифом із застосуванням відповідних коригувальних коефіцієнтів, затверджених у порядку, встановленому Законом України “Про державні фінансові гарантії медичного обслуговування населення”.
    </li>
    <li>
    Оплата медичних послуг за цим Договором здійснюється на підставі рахунку та Звіту Надавача протягом десяти календарних днів з дати подання Надавачем Звіту до Системи, а у випадку, передбаченому пунктом 4.3 цього Договору – з дати подання уточненого Звіту.
    </li>
    <li>
    Попередня оплата медичних послуг за Договором у випадках, встановлених Кабінетом Міністрів України, здійснюється протягом десяти календарних днів на підставі рахунку, поданого Надавачем.
    </li>
    <li>
    Надавач не має права вимагати та має забезпечити, що Працівники Надавача та Підрядники не вимагали від пацієнтів винагороди в будь-якій формі (в тому числі, у вигляді благодійних внесків, будь-яких платежів на користь третіх осіб, які є попередньою чи наступною умовою для отримання пацієнтами послуг) за медичні послуги, що надаються за цим Договором. Такі дії є підставою для притягнення до відповідальності Надавача у порядку передбаченому пунктом 6.4 цього Договору.
    </li>
    <li>
    Розрахунки за цим Договором здійснюються в безготівковій формі.
    </li>
    <li>
    Ціна Договору становить вартість всіх наданих послуг за цим Договором та зазначається в додатках до цього Договору. Ціна Договору може бути переглянута Сторонами, шляхом внесення відповідних змін до Договору.
    </li>
    </ol>
    </li>
    <li>
    <h2>6. ВІДПОВІДАЛЬНІСТЬ СТОРІН</h2>
    <ol class="sub">
    <li>
    У разі невиконання або неналежного виконання своїх зобов’язань за цим Договором Сторони несуть відповідальність, передбачену законом та цим Договором.
    </li>
    <li>
    У разі надання Надавачем послуг, що не відповідають переліку, обсягу або якості медичних послуг передбачених цим Договором, Надавач зобов’язаний повернути Замовнику сплачений за таку медичну послугу тариф з урахуванням коригувальних коефіцієнтів. Повернення Замовнику тарифу, сплаченого за надання медичних послуг, що не відповідають переліку, обсягу або якості медичних послуг передбачених цим Договором, не звільняють Надавача від відшкодування шкоди, завданої пацієнту.
    </li>
    <li>
    У разі встановлення за результатами звірки розбіжностей між відомостями, поданими Надавачем у Звітах та інформацією, що міститься в Системі, статистичній звітності Надавача, документах, які підтверджують надання медичних послуг, деклараціях про вибір лікаря, який надає ПМД, що відображені в Системі, Надавач зобов’язаний повернути надміру сплачені кошти Замовнику.
    </li>
    <li>
    У разі подання пацієнтом (його законним представником) або іншою заінтересованою особою до Замовника скарги про те, що Надавач, Працівники Надавача або Підрядники вимагали від пацієнта винагороди в будь-якій формі за медичні послуги, що мають бути надані пацієнтам за цим Договором, Замовник має право направити про це інформацію до правоохоронних органів. У разі набрання законної сили вироком суду про притягнення Працівника Надавача або Підрядника до кримінальної відповідальності за порушення права на безоплатну медичну допомогу або у разі наявності інших достатніх підстав вважати, що така вимога мала місце, Замовник має право в односторонньому порядку відмовитись від цього Договору.
    </li>
    <li>
    У разі, якщо після оплати за Звітом буде встановлена невідповідність даних Звіту інформації в Системі, Надавач зобов’язаний повернути Замовнику надміру сплачені кошти протягом трьох календарних днів з моменту отримання повідомлення від Замовника.
    </li>
    </ol>
    </li>
    <li class="fullsize">
    <h2>7. ВИРІШЕННЯ СПОРІВ</h2>
    <ol class="sub">
    <li>
    У разі виникнення між Сторонами будь-якого спору, такий спір підлягає вирішенню шляхом переговорів у строк не більше, ніж тридцять робочих днів.
    </li>
    <li>
    У разі недосягнення Сторонами згоди щодо спору шляхом переговорів, такий спір підлягає вирішенню судом відповідно до закону.
    </li>
    </ol>
    </li>
    <li>
    <h2>8. ОБСТАВИНИ НЕПЕРЕБОРНОЇ СИЛИ</h2>
    <ol class="sub">
    <li>
    Сторони звільняються від відповідальності за повне або часткове невиконання своїх зобов’язань за цим Договором, якщо таке невиконання стало наслідком обставин непереборної сили, що виникли після укладання цього Договору та які Сторони не могли передбачити чи попередити розумними заходами.
    </li>
    <li>
    Обставинами непереборної сили Сторони погодилися вважати: повені, землетруси, пожежі (не з вини Сторін), інші стихійні лиха, війну, воєнні дії, акти тероризму, страйки, що відповідають вимогам законодавства, акти центральних органів державної влади, валютні обмеження, зміни у законодавстві, що знаходяться поза розумним контролем Сторін.
    </li>
    <li>
    У випадку виникнення обставин, визначених пункті 8.2 цього Договору, Сторона, що зазнала їх впливу, повинна негайно за допомогою будь-яких доступних засобів повідомити про такі обставини іншу Сторону у максимально стислий строк, направши письмове Повідомлення про настання таких обставин.
    </li>
    <li>
    Повідомлення про обставини непереборної сили повинно містити вичерпну інформацію про природу обставин непереборної сили, час їх настання та оцінку їх впливу на можливість Сторони виконувати свої зобов’язання за Договором та на порядок виконання зобов’язань за Договором, у випадку якщо це можливо.
    </li>
    <li>
    Коли дія обставин, визначених пункті 8.2 цього Договору, припиняється, Сторона, що зазнала їх впливу, зобов’язана негайно, але в будь-якому випадку в строк не пізніше двадцяти чотирьох годин з моменту, коли Сторона дізналась або повинна була дізнатися про припинення зазначених обставин, письмово повідомити другу Сторону про їх припинення. Таке Повідомлення повинно містити інформацію про час припинення дії таких обставин та вказівку на строк, протягом якого Сторона виконає свої зобов’язання за Договором.
    </li>
    <li>
    Наявність та строк дії обставин непереборної сили підтверджується Торгово-промисловою палатою України.
    </li>
    <li>
    У випадку, якщо Сторона, що зазнала дії обставин непереборної сили, не направить або несвоєчасно направить повідомлення про обставини непереборної сили, як це визначено пунктом 8.4 цього Договору, така Сторона втрачає право посилатися на обставини непереборної сили як на підставу для звільнення від відповідальності за повне або часткове невиконання своїх зобов’язань за цим Договором.
    </li>
    <li>
    У разі коли дія обставин зазначених у пункті 8.2 цього Договору триває більше, ніж тридцять календарних днів, кожна із Сторін має право розірвати Договір та не несе відповідальність за таке розірвання за умови, що вона повідомить про це іншу Сторону не пізніше, ніж за десять календарних днів до розірвання.
    </li>
    </ol>
    </li>
    <li class="fullsize">
    <h2>9. СТРОК ДОГОВОРУ</h2>
    <ol class="sub">
    <li>
    Цей Договір вважається укладеним та набирає чинності з дати його підписання обома Сторонами.
    </li>
    <li>
    Цей Договір діє з <%= get_in(assigns, ~w(start_date)a) %> до <%= get_in(assigns, ~w(end_date)a) %> року. Строк Договору може бути продовжений за згодою Сторін не більше, ніж три місяці.
    </li>
    <li>
    Надавач зобов’язаний надавати пацієнтам медичні послуги протягом строку цього Договору.
    </li>
    </ol>
    </li>
    <li>
    <h2>10. ДОСТРОКОВЕ ПРИПИНЕННЯ ДОГОВОРУ</h2>
    <ol class="sub">
    <li>
    Цей Договір може бути достроково припинено на підставах, передбачених законом та цим Договором.
    </li>
    <li>
    Одностороння відмова Надавача від Договору не допускається, крім випадків, передбачених цим Договором та законом.
    </li>
    <li>
    Замовник має право відмовитися від Договору в односторонньому порядку у таких випадках:
    <ol class="sub">
    	<li>
    		анулювання ліцензії Надавача на провадження господарської діяльності з медичної практики або інших ліцензій чи дозволів, що потрібні для надання медичних послуг за Договором;
    	</li>
    	<li>
    		невідповідності Надавача Вимогам до надавача послуг з медичного обслуговування населення, з яким головними розпорядниками бюджетних коштів укладаються договори про медичне обслуговування населення, затвердженим Кабінетом Міністрів України;
    	</li>
    	<li>
    		отримання висновків, складених у встановленому законодавством порядку, яким підтверджується вчинення більше трьох порушень Надавачем галузевих стандартів у сфері охорони здоров’я протягом строку цього Договору;
    	</li>
    	<li>
    		залучення Надавачем для надання медичних послуг за цим Договором Підрядників, які не мають ліцензії на провадження відповідного виду господарської діяльності, залучення до надання медичної допомоги осіб, які не мають право надавати таку допомогу;
    	</li>
    	<li>
    		систематичного (більше трьох разів протягом строку цього Договору) порушення Надавачем своїх обов’язків щодо повідомлення Замовника та внесення в Систему інформації про зміну режиму роботи Надавача, адреси Місця надання медичних послуг, графіку надання медичних послуг Надавачем, графіку роботи Працівників Надавача, які надають медичну допомогу;
    	</li>
    	<li>
    		надання Замовнику та внесення до Системи завідомо недостовірних відомостей щодо наявного у Надавача матеріально-технічного оснащення (в тому числі обладнання) для надання медичних послуг за Договором, переліку Працівників Надавача та їх графіку роботи, відомостей про Підрядників, поданих такому Надавачу декларацій, інших даних;
    	</li>
    	<li>
    		у випадку, передбаченому п. 6.4 цього Договору.
    	</li>
    </ol>
    </li>
    <li>
    За наявності підстав, визначених пунктом 10.3 цього Договору, Договір припиняється через чотирнадцять календарних днів з дати отримання Надавачем відповідного письмового повідомлення Замовника про односторонню відмову від цього Договору.
    </li>
    <li>
    Сторони мають право вимагати дострокового розірвання цього Договору у випадках, передбачених законом.
    </li>
    <li>
    Розірвання цього Договору не потребує отримання попередньої (до розірвання) чи наступної згоди пацієнтів (їх законних представників).
    </li>
    </ol>
    </li>
    <li>
    <h2>11. ПРИКІНЦЕВІ ПОЛОЖЕННЯ</h2>
    <ol class="sub">
    <li>
    Будь-які зміни та/або доповнення до цього Договору вважаються чинними та обов’язковими для Сторін за умови, що вони подані в Системі та скріплені електронними підписами обох Сторін з дотриманням вимог законодавства про електронні документи та електронний документообіг.
    </li>
    <li>
    Не зважаючи на вимоги п. 11.1 цього Договору, у разі зміни контактів для запису на прийом до лікаря або інформації щодо лікарів, які надають ПМД, у відповідному Місці надання медичних послуг, пов’язаних з ПМД, що зазначені в додатку 1.2 до цього Договору, Надавач має надати Замовнику повідомлення в Системі з накладеним електронним підписом в строки, передбачені п. 3.4.19 та п. 3.4.18 цього Договору. Накладення електронного підпису Замовника на таке повідомлення не вимагається.
    </li>
    <li>
    Всі додатки до цього Договору, підписані належними Сторонами, є його невід’ємною частиною.
    </li>
    <li>
    Внесення будь-яких зміни та (або) доповнень до цього Договору не потребує попередньої (до внесення змін та (або) доповнень) чи наступної згоди пацієнтів (їх законних представників).
    </li>
    <li>
    Після підписання Сторонами Договору всі попередні переговори за ним, листування, попередні договори, протоколи про наміри та будь-які інші усні чи письмові домовленості Сторін з питань, що так чи інакше стосуються Договору, втрачають юридичну силу але можуть враховуватися при тлумаченні умов Договору.
    </li>
    <li>
    Сторони несуть повну відповідальність за правильність вказаних у Договорі реквізитів та ризик настання несприятливих наслідків у разі неповідомлення іншої Сторони про зміну своїх реквізитів.
    </li>
    </ol>
    </li>
    <li class="page fullsize">
    <h2>12. ДОДАТКИ ДО ДОГОВОРУ</h2>
    <table>
    <tr>
    <th>№ додатку</th>
    <th>Назва додатку</th>
    <th>До Договору додаються такі додатки (позначити знаком «+»)</th>
    </tr>
    <tr>
    <td>1.1.</td>
    <td>Спеціальні умови Договору щодо надання медичних послуг, пов’язаних з ПМД</td>
    <td>Так</td>
    </tr>
    <tr>
    <td>1.2.</td>
    <td>Місця надання медичних послуг, пов’язаних з ПМД</td>
    <td>Так</td>
    </tr>
    <tr>
    <td>2</td>
    <td>Підрядники, залучені до надання медичних послуг за Договором</td>
    <td> <%= if get_in(assigns, ~w(external_contractor_flag)a) do %>"Так"<% else %>"Ні"<% end %></td>
    </tr>
    </table>

    <ol class="sub topMargin">
    <li>
    Усі додатки до цього Договору набирають чинності з моменту їх підписання обома Сторонами в Системі та є його невід’ємною частиною.
    </li>
    </ol>
    </li>
    <li class="fullsize">
    <h2>13. Реквізити Сторін</h2>
    <table class="two">
    <tr>
    <td>
    	<p>
    		Надавач: <%= get_in(assigns, ~w(contractor_legal_entity name)a) %>
    	</p>
    	<p>
    		Код ЄДРПОУ/ РНОКПП: <%= get_in(assigns, ~w(contractor_legal_entity edrpou)a) %>
    	</p>
    	<p>
    		Місцезнаходження:
                        <%= get_in(assigns, ~w(contractor_legal_entity address zip)a) %>
                        <%= get_in(assigns, ~w(contractor_legal_entity address street_type)a) %>
                        <%= if get_in(assigns, ~w(contractor_legal_entity address street)a) do %>
                            <%= get_in(assigns, ~w(contractor_legal_entity address street)a) %>,
                        <% end %>
                        <%= if get_in(assigns, ~w(contractor_legal_entity address building)a) do %>
                            буд. <%= get_in(assigns, ~w(contractor_legal_entity address building)a) %>,
                        <% end %>
                        <%= if get_in(assigns, ~w(contractor_legal_entity address apartment)a) do %>
                            кв. <%= get_in(assigns, ~w(contractor_legal_entity address apartment)a) %>,
                        <% end %>
                        <%= get_in(assigns, ~w(contractor_legal_entity address settlement_type)a) %>
                        <%= if get_in(assigns, ~w(contractor_legal_entity address settlement)a) do %>
                            <%= get_in(assigns, ~w(contractor_legal_entity address settlement)a) %>,
                        <% end %>
                        <%= if get_in(assigns, ~w(contractor_legal_entity address region)a) do %>
                            <%= get_in(assigns, ~w(contractor_legal_entity address region)a) %> район,
                        <% end %>
                        <%= if get_in(assigns, ~w(contractor_legal_entity address area)a) do %>
                            <%= get_in(assigns, ~w(contractor_legal_entity address area)a) %> область,
                        <% end %>
    	</p>
    	<p>
    		Платіжні реквізити: <%= get_in(assigns, ~w(contractor_payment_details payer_account)a) %>
    		<br />
    		Банк: <%= get_in(assigns, ~w(contractor_payment_details bank_name)a) %>
    		<br />
    		Код банку: <%= get_in(assigns, ~w(contractor_payment_details MFO)a) %>
    	</p>
    </td>
    <td>
    	<p>Замовник: Національна служба здоров’я України</p>
    	<p>Код ЄДРПОУ/ РНОКПП:</p>
    	<p>Місцезнаходження:</p>
    	<p>Платіжні реквізити:</p>
    </td>
    </tr>
    </table>
    </li>
    </section>

    <section class="page">
    <header>
    <p class="bold">Додаток № 1.1</p>
    <p class="bold">Спеціальні умови Договору<br /> щодо надання медичних послуги, пов’язаних з ПМД </p>
    </header>

    <section>
    <ol>
    <li>
    Надавач зобов’язується надавати за Договором медичні послуги, пов’язані з ПМД, що визначені в Порядку надання первинної медичної допомоги, затвердженого МОЗ (далі – Порядок ПМД).
    </li>
    <li>
    Надавач зобов’язаний при наданні медичних послуг за Договором дотримуватися галузевих стандартів у сфері охорони здоров’я, зокрема:
    <ul>
    	<li></li>
    	<li></li>
    </ul>
    </li>
    <li>
    Надавач зобов’язується забезпечити:
    <ol class="brace">
    	<li>
    		своєчасне проведення профілактики, в тому числі профілактичних оглядів та направлення на проведення необхідних досліджень згідно з Порядком ПМД, своєчасне та у повному обсязі проведення профілактичних щеплень відповідно до Календаря профілактичних щеплень в Україні;
    	</li>
    	<li>
    		надання медичних послуг в черговому кабінеті ПМД, утвореному відповідно до законодавства, в тому числі у вихідні і святкові дні;
    	</li>
    	<li>
    		пацієнтам можливість отримати послуги протягом зазначеного в Додатку №1.2 графіку;
    	</li>
    	<li>
    		технічну можливість запису пацієнтів до черги на прийом до медичних працівників чи для отримання інших медичних послуг, за телефоном або в електронній формі;
    	</li>
    </ol>
    </li>
    <li>
    Загальна орієнтовна Ціна Договору щодо надання медичних послуги, пов’язаних з ПМД, становить <%= get_in(assigns, ~w(nhs_contract_price)a) %> грн. Сторони можуть час від часу переглядати Ціну Договору із внесенням відповідних змін до Договору.
    </li>
    <li>
    На дату укладення Договору тарифи та коригувальні коефіцієнти за послуги ПМД складають:
    <ul>
    	<li></li>
    	<li></li>
    </ul>
    </li>
    <li>
    Сума оплати за Звітний період визначається як 1/12 від добутку кількості пацієнтів, що подали Надавачу декларації про вибір лікаря, який надає ПМД, станом на 1 число Звітного періоду згідно з інформацією з Системи та застосовних тарифів та коригувальних коефіцієнтів.
    </li>
    <li>
    Додатково у 2018 році для комунальних закладів охорони здоров’я до суми оплати за Звітний період додається 1/12 від добутку кількості пацієнтів із червоного списку станом на 1-ше число місяця Звітного періоду та застосовного тарифу відповідно до Порядку реалізації державних гарантій медичного обслуговування населення за програмою медичних гарантій для первинної медичної допомоги на 2018 рік, затвердженого Кабінетом Міністрів України. Станом на 1 січня 2018 року наявне населення на території обслуговування Надавача (відповідного комунального закладу охорони здоров’я), становила <%= get_in(assigns, ~w(contractor_rmsp_amount)a) %> осіб.
    </li>
    <li>
    Інші умови (якщо застосовно):
    </li>
    </ol>
    </section>
    </section>

    <section class="page">
    <header>
    <p class="bold">Додаток № 1.2</p>
    <p class="bold">Місця надання медичних послуг, пов’язаних з ПМД*</p>
    </header>

    <%= Enum.map(get_in(assigns, ~w(contractor_divisions)a), fn contractor_division -> %>
      <section>
      <p>Запис в Системі: <%= get_in(contractor_division, ~w(id)a) %> </p>
      <p>Назва: <%= get_in(contractor_division, ~w(name)a) %> </p>
      <p>
      Адреса:
              <%= get_in(contractor_division, ~w(address zip)a) %>
              <%= get_in(contractor_division, ~w(address street_type)a) %>
              <%= if get_in(contractor_division, ~w(address street)a) do %>
                  <%= get_in(contractor_division, ~w(address street)a) %>,
              <% end %>
              <%= if get_in(contractor_division, ~w(address building)a) do %>
                  буд. <%= get_in(contractor_division, ~w(address building)a) %>,
              <% end %>
              <%= if get_in(contractor_division, ~w(address apartment)a) do %>
                  кв. <%= get_in(contractor_division, ~w(address apartment)a) %>,
              <% end %>
              <%= get_in(contractor_division, ~w(address settlement_type)a) %>
              <%= if get_in(contractor_division, ~w(address settlement)a) do %>
                  <%= get_in(contractor_division, ~w(address settlement)a) %>,
              <% end %>
              <%= if get_in(contractor_division, ~w(address region)a) do %>
                  <%= get_in(contractor_division, ~w(address region)a) %> район,
              <% end %>
              <%= if get_in(contractor_division, ~w(address area)a) do %>
                  <%= get_in(contractor_division, ~w(address area)a) %> область,
              <% end %>
      </p>
      <p>
      Знаходиться в населеному пункті, якому надано статус гірського:
              <%= if get_in(contractor_division, ~w(mountain_group)a) do %>
                  "так"
              <% else %>
                  "ні"
              <% end %>
      </p>
      <p>Контакти для запису на прийом до лікаря:</p>
      <p>
      Телефон: <%= get_in(contractor_division, ~w(phone number)a) %>
      </p>
      <p>
      Адреса електронної пошти: <%= get_in(contractor_division, ~w(email)a) %>
      </p>
      <p>Графік прийому пацієнтів за Договором (дні та час) - ?</p>
      <p>
      Графік роботи чергового кабінету ПМД:
      {`
      ${data.contractor_divisions[i].working_hours}
      `}
      </p>
      <p>Лікарі, які надають ПМД, у відповідному Місці надання медичних послуг, пов’язаних з ПМД:</p>
      <table class="smallFont">
      <tr>
        <th class="name">П.І.Б.</th>
        <th class="systemEntry">Запис про медичного працівника в Системі</th>
        <th class="speciality">Спеціальність</th>
        <th class="fte">Штатна одиниця</th>
        <th class="patientCount">Максимальна кількість пацієнтів, які можуть подати декларації про вибір такого лікаря за договором, осіб</th>
      </tr>
      <%= assigns |> get_in(~w(contractor_employee_divisions)a |> Enum.filter(fn contractor_employee_division -> contractor_employee_division.division_id == get_in(contractor_division, ~w(id)a) end)) |> Enum.map(fn contractor_employee_division -> %>
        <tr>
          <td class="name">
            <p>
              <%= if get_in(contractor_employee_division, ~w(employee party second_name)a) do %>
                  <%= get_in(contractor_employee_division, ~w(employee party last_name)a) %>
                  <%= get_in(contractor_employee_division, ~w(employee party first_name)a) %>
                  <%= get_in(contractor_employee_division, ~w(employee party second_name)a) %>
              <% else %>
                  <%= get_in(contractor_employee_division, ~w(employee party last_name)a) %>
                  <%= get_in(contractor_employee_division, ~w(employee party first_name)a) %>
              <% end %>
            </p>
          </td>
          <td class="systemEntry">
            <p>
              <%= get_in(contractor_employee_division, ~w(employee id)a) %>
            </p>
          </td>
          <td class="speciality">
            <p>
              <%= get_in(contractor_employee_division, ~w(employee speciality speciality)a) %>
            </p>
          </td>
          <td class="fte">
            <p>
              <%= get_in(contractor_employee_division, ~w(staff_units)a) %>
            </p>
          </td>
          <td class="patientCount">
            <p>
              <%= get_in(contractor_employee_division, ~w(employee declaration_limit)a) %>
            </p>
          </td>
        </tr>
      <% end) %>
      </table>
      <p class="italic">*Заповнюється стільки додатків, скільки є Місць надання медичних послуг, пов’язаних з ПМД</p>
      </section>
    <% end) %>
    </section>

    <section class="page">
    <header>
        <p class="bold">Додаток № 2</p>
        <p class="bold">Підрядники, залучені до надання медичних послуг за Договором </p>
    </header>

    <section>
        <table class="smallFont entryTwo">
            <tr>
                <th>Запис про Надавача в Системі</th>
                <th>Найменування закладу охорони здоров’я / ПІБ фізичної особи-підприємця</th>
                <th>Запис про Місце  надання медичних послуг в Системі<sup>1</sup></th>
                <th>Види медичних послуг, які надаються Підрядником</th>
                <th>Номер, дата укладення та строк дії договору з Підрядником</th>
            </tr>
            <%= assigns |> get_in(~w(external_contractors)a) |> Enum.map(fn external_contractor ->  %>
            <tr>
                <td class="systemEntry">
                    <p><%= get_in(external_contractor, ~w(legal_entity id)a) %></p>
                </td>
                <td class="entityName">
                    <p><%= get_in(external_contractor, ~w(legal_entity name)a) %></p>
                </td>
                <td class="divisionsId">
                    <p>
                        <ul>
                        <%= Enum.map(external_contractor.divisions, fn division -> %>
                            <li><%= get_in(division, ~w(id)a) %></li>
                        <% end) %>
                        </ul>
                    </p>
                </td>
                <td class="speciality">
                    <p>
                        <ul>
                        <%= Enum.map(external_contractor.divisions, fn division -> %>
                            <li><%= get_in(division, ~w(medical_service)a) %></li>
                        <% end) %>
                        </ul>
                    </p>
                </td>
                <td class="patientCount">
                    <p>
                        Номер: <br />
                            <%= get_in(external_contractor, ~w(contract number)a) %>
                            <br />
                        Діє з: <br />
                            <%= get_in(external_contractor, ~w(contract issued_at)a) %>
                            <br />
                        по: <br />
                            <%= get_in(external_contractor, ~w(contract expires_at)a) %>
                    </p>
                </td>
            </tr>
            <% end) %>
        </table>

        <p class="small">
            <sup>1</sup> Має співпадати з Місцем надання медичних послуг Надавача за Договором
        </p>
    </section>
    </section>

    </body>
    </html>

    ' where title = 'CRPF';
    """)
  end
end
